avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/algorithm/signaling.c
static ssize_t wslay_recv_cb(wslay_event_context_ptr ctx, uint8_t *buf, size_t len,
                             int flags, void *user_data) {
    (void) flags;
    SignalingHandle sig = (SignalingHandle) user_data;
    int32_t n = cy_awsport_network_receive(&sig->net_ctx, buf, len);
    if (n < 0) {
        sig->transport_error = true;
        wslay_event_set_error(ctx, WSLAY_ERR_CALLBACK_FAILURE);
        printf("[sig] sock recv error n=%d\n", (int) n);
        return -1;
    }
    if (0 == n) {
        wslay_event_set_error(ctx, WSLAY_ERR_WOULDBLOCK);
        return -1;
    }
    return (ssize_t) n;
}

static ssize_t wslay_send_cb(wslay_event_context_ptr ctx, const uint8_t *data, size_t len,
                             int flags, void *user_data) {
    (void) flags;
    SignalingHandle sig = (SignalingHandle) user_data;
    int32_t n = cy_awsport_network_send(&sig->net_ctx, data, len);
    if (n < 0) {
        sig->transport_error = true;
        wslay_event_set_error(ctx, WSLAY_ERR_CALLBACK_FAILURE);
        printf("[sig] sock send error n=%d\n", (int) n);
        return -1;
    }
    if (0 == n) {
        wslay_event_set_error(ctx, WSLAY_ERR_WOULDBLOCK);
        return -1;
    }
    return (ssize_t) n;
}

static int wslay_genmask_cb(wslay_event_context_ptr ctx, uint8_t *buf, size_t len,
                            void *user_data) {
    (void) ctx;
    (void) user_data;
    if (0 != webrtc_csprng_bytes(buf, len)) {
        return -1;
    }
    return 0;
}

// Dispatch a single inbound text frame. Called from on_msg_recv, possibly
// multiple times per wslay_event_recv() call when KVS bursts frames. If the
// envelope is an SDP_OFFER and we don't already have one, decode it into the
// caller's buffer and flip offer_ready. Anything else is logged and dropped.
static void dispatch_text_frame(SignalingHandle sig, const uint8_t *msg, size_t msg_len) {
    WssRecvMessage_t recv = { 0 };
    SignalingResult_t sig_rc = Signaling_ParseWssRecvMessage((const char *) msg, msg_len, &recv);
    if (SIGNALING_RESULT_OK != sig_rc) {
        printf("[sig] parse fail rc=%d len=%u\n", (int) sig_rc, (unsigned) msg_len);
        return;
    }

    // Per-frame decoded type. SignalingTypeMessage_t: 0=UNKNOWN, 1=SDP_OFFER,
    // 2=SDP_ANSWER, 3=ICE_CANDIDATE, 4=GO_AWAY, 5=RECONNECT_ICE_SERVER,
    // 6=STATUS_RESPONSE.
    printf("[sig]   type=%d sender=%.*s\n",
           (int) recv.messageType,
           (int) recv.senderClientIdLength, recv.pSenderClientId ? recv.pSenderClientId : "");

    if (SIGNALING_TYPE_MESSAGE_ICE_CANDIDATE == recv.messageType) {
        // D4b: decode base64 payload + JSON-parse + feed to ICE controller.
        // Inbound ICE_CANDIDATE JSON shape mirrors what we send out:
        //   {"candidate":"<sdp body>","sdpMid":"0","sdpMLineIndex":0,
        //    "usernameFragment":"…"}
        // Payloads are small (Chrome's typical candidate is ~150-250 B
        // base64, ~110-180 B decoded). 512 B stack scratch is comfortable.
        if (NULL == recv.pBase64EncodedPayload || 0 == recv.base64EncodedPayloadLength) {
            return;
        }
        uint8_t payload[512];
        size_t decoded_len = 0;
        int b64_rc = mbedtls_base64_decode(
            payload, sizeof(payload), &decoded_len,
            (const unsigned char *) recv.pBase64EncodedPayload,
            recv.base64EncodedPayloadLength);
        if (0 != b64_rc) {
            printf("[signaling] ICE_CANDIDATE base64 decode failed: -0x%04x (len=%u)\n",
                   -b64_rc, (unsigned) recv.base64EncodedPayloadLength);
            return;
        }
        if (NULL == sig->peer_connection_session) {
            printf("[signaling] ICE_CANDIDATE arrived before peer session attach, dropping\n");
            return;
        }

        PeerConnectionResult_t pc_rc = PeerConnection_AddRemoteCandidate(
            sig->peer_connection_session,
            (const char *) payload,
            decoded_len
        );
        if (
            PEER_CONNECTION_RESULT_OK != pc_rc &&
            PEER_CONNECTION_RESULT_FAIL_ICE_CONTROLLER_DESERIALIZE_CANDIDATE != pc_rc
        ) {
            printf("[signaling] PeerConnection_AddRemoteCandidate failed: %d\n", (int) pc_rc);
        }
        return;
    }

    if (SIGNALING_TYPE_MESSAGE_SDP_OFFER != recv.messageType) {
        // GO_AWAY / RECONNECT_ICE_SERVER / STATUS_RESPONSE land later.
        return;
    }

    if (sig->offer_ready) {
        // Already captured an offer this wait_for_offer cycle. KVS shouldn't
        // re-send SDP_OFFER mid-handshake but log if it does.
        printf("[signaling] duplicate SDP_OFFER, dropping (%u bytes)\n", (unsigned) msg_len);
        return;
    }

    if (NULL == recv.pBase64EncodedPayload || 0 == recv.base64EncodedPayloadLength) {
        printf("[signaling] SDP_OFFER missing messagePayload\n");
        return;
    }
    if (NULL == sig->offer_sdp_buf || sig->offer_sdp_cap < 2) {
        // Caller never set up a buffer (frame arrived outside wait_for_offer);
        // shouldn't happen since we tear down g_sig.ws_ctx in disconnect.
        printf("[signaling] SDP_OFFER arrived without an active buffer\n");
        return;
    }

    if (recv.senderClientIdLength >= sizeof(sig->peer_client_id)) {
        printf("[signaling] senderClientId too long (%u >= %u)\n",
               (unsigned) recv.senderClientIdLength, (unsigned) sizeof(sig->peer_client_id));
        return;
    }
    if (recv.senderClientIdLength > 0) {
        memcpy(sig->peer_client_id, recv.pSenderClientId, recv.senderClientIdLength);
    }
    sig->peer_client_id[recv.senderClientIdLength] = '\0';
    sig->peer_client_id_len = recv.senderClientIdLength;

    size_t decoded_len = 0;
    int b64_rc = mbedtls_base64_decode(
        (unsigned char *) sig->offer_sdp_buf, sig->offer_sdp_cap - 1, &decoded_len,
        (const unsigned char *) recv.pBase64EncodedPayload,
        recv.base64EncodedPayloadLength
    );
    if (0 != b64_rc) {
        printf("[signaling] base64 decode of SDP_OFFER payload failed: -0x%04x\n", -b64_rc);
        return;
    }
    sig->offer_sdp_buf[decoded_len] = '\0';

