avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/algorithm/signaling.c
    // The base64-decoded payload is a JSON envelope: {"type":"offer","sdp":"<sdp>"}.
    // Chrome / KVS escapes \r and \n inside the SDP as the two-byte literal
    // sequences \r and \n. Unwrap + un-escape in place so callers see real
    // SDP with real CR/LF.
    char *p = strstr(sig->offer_sdp_buf, "\"sdp\":\"");
    if (NULL == p) {
        printf("[signaling] SDP_OFFER envelope missing \"sdp\" key\n");
        return;
    }
    p += 7;     // past `"sdp":"`
    char *dst = sig->offer_sdp_buf;
    const char *src = p;
    const char *end = sig->offer_sdp_buf + decoded_len;
    bool closed = false;
    while (src < end) {
        char c = *src++;
        if ('\\' == c && src < end) {
            char esc = *src++;
            switch (esc) {
                case 'r':  *dst++ = '\r'; break;
                case 'n':  *dst++ = '\n'; break;
                case 't':  *dst++ = '\t'; break;
                case '"':  *dst++ = '"';  break;
                case '\\': *dst++ = '\\'; break;
                case '/':  *dst++ = '/';  break;
                default:
                    // Unknown escape — keep literal so we can spot it in logs.
                    *dst++ = '\\';
                    *dst++ = esc;
                    break;
            }
        } else if ('"' == c) {
            // Closing quote of the "sdp" value.
            closed = true;
            break;
        } else {
            *dst++ = c;
        }
    }
    if (!closed) {
        printf("[signaling] SDP_OFFER envelope: unterminated \"sdp\" string\n");
        return;
    }
    size_t sdp_len = (size_t)(dst - sig->offer_sdp_buf);
    sig->offer_sdp_buf[sdp_len] = '\0';
    sig->offer_sdp_len = sdp_len;
    sig->offer_ready = true;
}

static void wslay_on_msg_recv_cb(wslay_event_context_ptr ctx,
                                 const struct wslay_event_on_msg_recv_arg *arg,
                                 void *user_data) {
    (void) ctx;
    SignalingHandle sig = (SignalingHandle) user_data;

    if (wslay_is_ctrl_frame(arg->opcode)) {
        // wslay handles ping/close/pong queueing itself; just log for triage.
        if (WSLAY_CONNECTION_CLOSE == arg->opcode) {
            printf("[signaling] WS close (status=%u, len=%u)\n",
                   (unsigned) arg->status_code, (unsigned) arg->msg_length);
        }
        return;
    }

    // One line per WS frame is useful flow tracing for Increment D bring-up
    // (ICE controller wiring). messageType is decoded in dispatch_text_frame.
    printf("[sig] frame op=0x%x len=%u\n",
           (unsigned) arg->opcode, (unsigned) arg->msg_length);
    dispatch_text_frame(sig, arg->msg, arg->msg_length);
}

static const struct wslay_event_callbacks g_wslay_cbs = {
    wslay_recv_cb,
    wslay_send_cb,
    wslay_genmask_cb,
    NULL,                   // on_frame_recv_start
    NULL,                   // on_frame_recv_chunk
    NULL,                   // on_frame_recv_end
    wslay_on_msg_recv_cb,
};


SignalingHandle signaling_connect(const char *signed_url) {
    if (NULL == signed_url) {
        return NULL;
    }
    if (g_sig.connected) {
        printf("[signaling] signaling_connect called while already connected\n");
        return NULL;
    }

    char *host = NULL;
    const char *path = NULL;
    if (0 != wss_url_split(signed_url, &host, &path)) {
        return NULL;
    }

    // 1. Generate Sec-WebSocket-Key: 16 random bytes, base64-encoded.
    uint8_t nonce[WSS_NONCE_LEN];
    if (0 != webrtc_csprng_bytes(nonce, sizeof(nonce))) {
        printf("[signaling] csprng failed for Sec-WebSocket-Key\n");
        free(host);
        return NULL;
    }
    char nonce_b64[WSS_NONCE_B64_LEN];
    size_t nonce_b64_len = 0;
    if (0 != mbedtls_base64_encode((unsigned char *) nonce_b64, sizeof(nonce_b64), &nonce_b64_len, nonce, sizeof(nonce))) {
        printf("[signaling] base64 encode failed for Sec-WebSocket-Key\n");
        free(host);
        return NULL;
    }
    nonce_b64[nonce_b64_len] = '\0';

    // 2. Open TLS connection to host:443. Cert verify against AmazonRootCA1.
    cy_awsport_server_info_t server_info = {
        .host_name = host,
        .port      = WSS_PORT,
    };
    cy_awsport_ssl_credentials_t ssl = {
        .root_ca           = (const char *) IOTCL_AMAZON_ROOT_CA1,
        .root_ca_size      = strlen(IOTCL_AMAZON_ROOT_CA1) + 1,
        .root_ca_verify_mode = CY_AWS_ROOTCA_VERIFY_REQUIRED,
        .sni_host_name     = host,
        .sni_host_name_size = strlen(host) + 1,
    };

    cy_rslt_t r = cy_awsport_network_create(&g_sig.net_ctx, &server_info, &ssl, NULL, NULL);
    if (CY_RSLT_SUCCESS != r) {
        printf("[signaling] cy_awsport_network_create failed: 0x%08lx\n", (unsigned long) r);
        free(host);
        return NULL;
    }
    r = cy_awsport_network_connect(&g_sig.net_ctx, WSS_SOCK_SEND_TIMEOUT_MS, WSS_SOCK_RECV_TIMEOUT_MS);
    if (CY_RSLT_SUCCESS != r) {
        printf("[signaling] cy_awsport_network_connect failed: 0x%08lx\n", (unsigned long) r);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    // 3. Build the upgrade request. Size the buffer from the actual URL —
    //    presigned URLs run multi-KB once the URI-encoded session token is
    //    in there, so a fixed scratch doesn't cut it.
    size_t req_cap = strlen(path) + strlen(host) + WSS_REQ_FIXED_OVERHEAD;
    char *req = malloc(req_cap);
    if (NULL == req) {
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }
    // Header set mirrors the working KVS reference (Ameba wslay_helper):
    // Pragma + Cache-Control + Sec-WebSocket-Protocol all matter to AWS even
    // though only Upgrade/Connection/Key/Version are RFC 6455 mandatory. With
    // these headers absent AWS forwards ICE_CANDIDATE messages to the master
    // but holds back SDP_OFFER (observed empirically — see PILOT.md §3.1
    // 2026-05-06 entry). Sec-WebSocket-Protocol value "wss" is non-standard
    // (RFC 6455 wants subprotocol names, not URL schemes) but matches what
    // every working KVS-WebRTC port sends.
    int req_len = snprintf(req, req_cap,
        "GET %s HTTP/1.1\r\n"
        "Host: %s\r\n"
        "Pragma: no-cache\r\n"
        "Cache-Control: no-cache\r\n"
        "Upgrade: websocket\r\n"
        "Connection: Upgrade\r\n"
        "Sec-WebSocket-Key: %s\r\n"
        "Sec-WebSocket-Protocol: wss\r\n"
        "Sec-WebSocket-Version: 13\r\n"
        "\r\n",
        path, host, nonce_b64
    );
    if (req_len <= 0 || (size_t) req_len >= req_cap) {
        printf("[signaling] WSS upgrade request did not fit in %d bytes\n", (int) req_cap);
        free(req);
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    int32_t sent = cy_awsport_network_send(&g_sig.net_ctx, req, (size_t) req_len);
    free(req);
    if (sent != req_len) {
        printf("[signaling] WSS upgrade send short/failed: %d/%d\n", (int) sent, req_len);
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    // 4. Receive the response head.
    uint8_t resp[WSS_RESP_BUF_LEN];
    int resp_len = wss_recv_head(&g_sig.net_ctx, resp, sizeof(resp));
    if (resp_len < 0) {
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    // 5. Verify status line is "HTTP/1.1 101".
    //    Min length of a valid 101 line is "HTTP/1.1 101 X\r\n" — 16 bytes.
    if (resp_len < 16 || 0 != memcmp(resp, "HTTP/1.1 101", 12)) {
        // Print the status line for triage.
        size_t line_end = 0;
        while (line_end + 1 < (size_t) resp_len && !(resp[line_end] == '\r' && resp[line_end+1] == '\n')) line_end++;
        printf("[signaling] WSS upgrade not 101: %.*s\n", (int) line_end, (const char *) resp);
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    // 6. Find Sec-WebSocket-Accept and verify it matches base64(SHA1(key+GUID)).
    //    Skip the status line so the header search starts at the first header.
    size_t hdr_off = 0;
    while (hdr_off + 1 < (size_t) resp_len && !(resp[hdr_off] == '\r' && resp[hdr_off+1] == '\n')) hdr_off++;
    hdr_off += 2;
    size_t accept_len = 0;
    const char *accept_val = wss_find_header((const char *) resp + hdr_off, (size_t) resp_len - hdr_off,
                                             "Sec-WebSocket-Accept", &accept_len);
    if (NULL == accept_val) {
        printf("[signaling] WSS upgrade response missing Sec-WebSocket-Accept\n");
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }
    char expected[WSS_ACCEPT_B64_LEN];
    if (0 != wss_compute_accept(nonce_b64, expected, sizeof(expected))) {
        printf("[signaling] failed to compute expected Sec-WebSocket-Accept\n");
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }
    size_t expected_len = strlen(expected);
    if (accept_len != expected_len || 0 != memcmp(accept_val, expected, expected_len)) {
        printf("[signaling] Sec-WebSocket-Accept mismatch (got %.*s, want %s)\n",
            (int) accept_len, accept_val, expected);
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    free(host);

    // 7. 101 verified — hand the open NetworkContext_t to wslay. From here on
    //    all I/O on this connection goes through the event-loop callbacks.
    int wrc = wslay_event_context_client_init(&g_sig.ws_ctx, &g_wslay_cbs, &g_sig);
    if (0 != wrc) {
        printf("[signaling] wslay_event_context_client_init failed: %d\n", wrc);
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        return NULL;
    }

    g_sig.connected = true;
    g_sig.transport_error = false;
    g_sig.offer_sdp_buf = NULL;
    g_sig.offer_sdp_cap = 0;
    g_sig.offer_sdp_len = 0;
    g_sig.offer_ready = false;
    g_sig.peer_client_id[0] = '\0';
    g_sig.peer_client_id_len = 0;
    g_sig.peer_connection_session = NULL;
    printf("[signaling] WS upgrade OK (101 Switching Protocols)\n");
    return &g_sig;
}

void signaling_disconnect(SignalingHandle sig) {
    if (NULL == sig || !sig->connected) {
        return;
    }
    if (NULL != sig->ws_ctx) {
        wslay_event_context_free(sig->ws_ctx);
        sig->ws_ctx = NULL;
    }
    sig->offer_sdp_buf = NULL;
    sig->offer_sdp_cap = 0;
    sig->offer_sdp_len = 0;
    sig->offer_ready = false;
    sig->peer_connection_session = NULL;
    cy_awsport_network_disconnect(&sig->net_ctx);
    cy_awsport_network_delete(&sig->net_ctx);
    sig->connected = false;
}

// -------------------------------------------------------------------------
// Step 5b Increment C — JSON envelope wrap/unwrap (messageType / messagePayload)
// -------------------------------------------------------------------------
//
// Receive shape (KVS docs, lowercase keys):
//   { "senderClientId":"<uuid>", "messageType":"SDP_OFFER",
//     "messagePayload":"<base64-encoded SDP>" }
//
// Send shape (KVS docs, mixed-case keys with "action"):
//   { "action":"SDP_ANSWER", "RecipientClientId":"<uuid>",
//     "MessagePayload":"<base64-encoded SDP>" }
//
// The upstream signaling lib (Signaling_ParseWssRecvMessage /
// Signaling_ConstructWssMessage) handles the JSON shape on both sides; we
// own the base64 step on either side and the wslay queue/drive on send.

// Drive the wslay event loop until on_msg_recv flips offer_ready, the peer
// closes, or the socket dies. On success returns 0 with out_sdp populated
// (filled inline by dispatch_text_frame) and senderClientId latched on the
// handle.
//
// No wall-clock budget — we're MASTER and may idle indefinitely waiting for
// a viewer (browser) to publish. The recv callback's per-call socket timeout
// (WSS_SOCK_RECV_TIMEOUT_MS) keeps the loop cooperative; shutdown from
// app_webrtc_stop() cuts the socket, which the recv callback observes as < 0
// and propagates as transport_error.
int signaling_wait_for_offer(SignalingHandle sig, char *out_sdp, size_t out_sdp_cap, size_t *out_sdp_len) {
    if (NULL == sig || NULL == out_sdp || out_sdp_cap < 2 || NULL == out_sdp_len
        || !sig->connected || NULL == sig->ws_ctx) {
        return -1;
    }
    *out_sdp_len = 0;

    // Park the caller's buffer where dispatch_text_frame can find it. Cleared
    // before we return so a stale pointer can't survive between sessions.
    sig->offer_sdp_buf = out_sdp;
    sig->offer_sdp_cap = out_sdp_cap;
    sig->offer_sdp_len = 0;
    sig->offer_ready = false;

    int rc;
    for (;;) {
        // Send any queued frames first (close, pong, future messages).
        if (wslay_event_want_write(sig->ws_ctx)) {
            int wrc = wslay_event_send(sig->ws_ctx);
            if (0 != wrc && !sig->offer_ready) {
                printf("[sig] wslay_event_send rc=%d\n", wrc);
                rc = -1;
                goto out;
            }
        }

        int recv_err = 0;
        if (wslay_event_want_read(sig->ws_ctx)) {
            recv_err = wslay_event_recv(sig->ws_ctx);
        }

        // dispatch_text_frame fires synchronously inside wslay_event_recv,
        // potentially multiple times per call when KVS bursts frames. Check
        // offer_ready before treating an error as fatal — once we have the
        // offer the socket close that often follows is irrelevant.
        if (sig->offer_ready) {
            *out_sdp_len = sig->offer_sdp_len;
            rc = 0;
            goto out;
        }

        if (0 != recv_err) {
            printf("[sig] wslay_event_recv rc=%d transport_err=%d\n",
                   recv_err, (int) sig->transport_error);
            rc = -1;
            goto out;
        }

        if (sig->transport_error) {
            rc = -1;
            goto out;
        }

        if (!wslay_event_want_read(sig->ws_ctx) && !wslay_event_want_write(sig->ws_ctx)) {
            // Read+write both disabled — peer closed cleanly, nothing left.
            printf("[sig] peer close, read+write both disabled\n");
            rc = -1;
            goto out;
        }

        // Yield. The recv callback already blocks up to WSS_SOCK_RECV_TIMEOUT_MS,
        // but want_read may be 0 (e.g., right after a control-frame round trip),
        // so a small extra yield keeps this loop cooperative.
        vTaskDelay(pdMS_TO_TICKS(20));
    }

out:
    printf("[sig] wait_for_offer exit rc=%d offer_ready=%d\n",
           rc, (int) sig->offer_ready);
    // Drop the parked buffer — it's only valid for the duration of this call.
    sig->offer_sdp_buf = NULL;
    sig->offer_sdp_cap = 0;
    return rc;
}

int signaling_tick(SignalingHandle sig) {
    if (NULL == sig || !sig->connected || NULL == sig->ws_ctx) {
        return -1;
    }
    if (sig->transport_error) {
        return -1;
    }
    if (wslay_event_want_write(sig->ws_ctx)) {
        int wrc = wslay_event_send(sig->ws_ctx);
        if (0 != wrc) {
            printf("[sig] tick: wslay_event_send rc=%d\n", wrc);
            return -1;
        }
    }
    if (wslay_event_want_read(sig->ws_ctx)) {
        int wrc = wslay_event_recv(sig->ws_ctx);
        if (0 != wrc) {
            printf("[sig] tick: wslay_event_recv rc=%d\n", wrc);
            return -1;
        }
    }
    if (sig->transport_error) {
        return -1;
    }
    if (!wslay_event_want_read(sig->ws_ctx) && !wslay_event_want_write(sig->ws_ctx)) {
        // Peer closed cleanly.
        printf("[sig] tick: peer close (read+write disabled)\n");
        return -1;
    }
    return 0;
}


int signaling_send_answer(SignalingHandle sig, const char *sdp_answer) {
    if (NULL == sig || NULL == sdp_answer || !sig->connected || NULL == sig->ws_ctx) {
        printf("[signaling] send_answer: bad args or not connected (sig=%p, sdp=%p, connected=%d, ws=%p)\n",
               (void*)sig, (void*)sdp_answer, sig ? (int)sig->connected : -1, sig ? (void*)sig->ws_ctx : NULL);
        return -1;
    }
    if (sig->transport_error) {
        printf("[signaling] send_answer: transport already in error\n");
        return -1;
    }
    printf("[signaling] send_answer: peer_client_id='%.*s' (len=%u)\n",
           (int)sig->peer_client_id_len, sig->peer_client_id,
           (unsigned)sig->peer_client_id_len);
    printf("[signaling] send_answer: starting (sdp_len=%u)\n", (unsigned) strlen(sdp_answer));

    size_t sdp_len = strlen(sdp_answer);

    // Base64-encode the SDP. Output size is deterministic: ceil(n/3)*4, plus
    // mbedTLS uses one extra byte for an internal null terminator in dlen.
    size_t b64_cap = 4 * ((sdp_len + 2) / 3) + 1;
    char *b64_buf = malloc(b64_cap);
    if (NULL == b64_buf) {
        printf("[signaling] OOM for base64 buffer (%u bytes)\n", (unsigned) b64_cap);
        return -1;
    }
    size_t b64_len = 0;
    int b64_rc = mbedtls_base64_encode((unsigned char *) b64_buf, b64_cap, &b64_len,
                                       (const unsigned char *) sdp_answer, sdp_len);
    if (0 != b64_rc) {
        printf("[signaling] base64 encode failed: -0x%04x\n", -b64_rc);
        free(b64_buf);
        return -1;
    }
    printf("[signaling] send_answer b64_len=%u, first 64 chars: %.64s\n",
           (unsigned) b64_len, b64_buf);

    // Wrap in the KVS WSS send envelope. JSON skeleton (action/keys/braces/
    // quotes/commas) is ~80 bytes; flat 256 leaves headroom for KVS docs drift.
    size_t env_cap = b64_len + sig->peer_client_id_len + 256;
    char *env_buf = malloc(env_cap);
    if (NULL == env_buf) {
        printf("[signaling] OOM for envelope buffer (%u bytes)\n", (unsigned) env_cap);
        free(b64_buf);
        return -1;
    }
    WssSendMessage_t send_msg = {
        .messageType                = SIGNALING_TYPE_MESSAGE_SDP_ANSWER,
        .pRecipientClientId         = sig->peer_client_id,
        .recipientClientIdLength    = sig->peer_client_id_len,
        .pBase64EncodedMessage      = b64_buf,
        .base64EncodedMessageLength = b64_len,
        .pCorrelationId             = NULL,
        .correlationIdLength        = 0,
    };
    size_t env_len = env_cap;
    SignalingResult_t sig_rc = Signaling_ConstructWssMessage(&send_msg, env_buf, &env_len);
    free(b64_buf);
    if (SIGNALING_RESULT_OK != sig_rc) {
        printf("[signaling] ConstructWssMessage failed: %d\n", (int) sig_rc);
        free(env_buf);
        return -1;
    }
    printf("[signaling] send_answer envelope (first 256 bytes): %.*s\n",
           (int)(env_len < 256 ? env_len : 256), env_buf);

