avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/algorithm/signaling.c
    // Queue as a single WS text frame. wslay_event_omsg_non_fragmented_init
    // mallocs+memcpys the msg, so env_buf is safe to free immediately after.
    struct wslay_event_msg ws_msg = {
        .opcode     = WSLAY_TEXT_FRAME,
        .msg        = (const uint8_t *) env_buf,
        .msg_length = env_len,
    };
    int wrc = wslay_event_queue_msg(sig->ws_ctx, &ws_msg);
    free(env_buf);
    if (0 != wrc) {
        printf("[signaling] wslay_event_queue_msg failed: %d\n", wrc);
        return -1;
    }
    printf("[signaling] send_answer: queued (%u bytes), signaling_tick will drain it\n", (unsigned) env_len);
    return 0;
}

int signaling_send_ice_candidate(
    SignalingHandle sig,
    const char *candidate,
    const char *sdp_mid,
    int sdp_m_line_index
) {
    if (NULL == sig || NULL == candidate || NULL == sdp_mid
        || !sig->connected || NULL == sig->ws_ctx) {
        return -1;
    }
    if (sig->transport_error) {
        printf("[signaling] send_ice_candidate: transport already in error\n");
        return -1;
    }

    /* Build the inner JSON payload that the browser's signaling layer parses
     * into RTCIceCandidateInit. The senderClientId / messagePayload envelope
     * the upstream lib adds wraps this. */
    size_t cand_len = strlen(candidate);
    size_t mid_len  = strlen(sdp_mid);
    /* Skeleton: {"candidate":"","sdpMid":"","sdpMLineIndex":N} ~ 50 B + N digits. */
    size_t json_cap = cand_len + mid_len + 64;
    char *json_buf = malloc(json_cap);
    if (NULL == json_buf) {
        printf("[signaling] OOM for ice candidate JSON (%u bytes)\n", (unsigned) json_cap);
        return -1;
    }
    int json_len = snprintf(json_buf, json_cap,
        "{\"candidate\":\"%s\",\"sdpMid\":\"%s\",\"sdpMLineIndex\":%d}",
        candidate, sdp_mid, sdp_m_line_index);
    if (json_len <= 0 || (size_t) json_len >= json_cap) {
        printf("[signaling] ice candidate JSON overflow\n");
        free(json_buf);
        return -1;
    }

    size_t b64_cap = 4 * (((size_t) json_len + 2) / 3) + 1;
    char *b64_buf = malloc(b64_cap);
    if (NULL == b64_buf) {
        printf("[signaling] OOM for ice b64 buffer (%u bytes)\n", (unsigned) b64_cap);
        free(json_buf);
        return -1;
    }
    size_t b64_len = 0;
    int b64_rc = mbedtls_base64_encode((unsigned char *) b64_buf, b64_cap, &b64_len,
                                       (const unsigned char *) json_buf, (size_t) json_len);
    free(json_buf);
    if (0 != b64_rc) {
        printf("[signaling] ice candidate base64 encode failed: -0x%04x\n", -b64_rc);
        free(b64_buf);
        return -1;
    }

    size_t env_cap = b64_len + sig->peer_client_id_len + 256;
    char *env_buf = malloc(env_cap);
    if (NULL == env_buf) {
        printf("[signaling] OOM for ice envelope (%u bytes)\n", (unsigned) env_cap);
        free(b64_buf);
        return -1;
    }
    WssSendMessage_t send_msg = {
        .messageType                = SIGNALING_TYPE_MESSAGE_ICE_CANDIDATE,
        .pRecipientClientId         = sig->peer_client_id,
        .recipientClientIdLength    = sig->peer_client_id_len,
        .pBase64EncodedMessage      = b64_buf,
        .base64EncodedMessageLength = b64_len,
        .pCorrelationId             = NULL,
        .correlationIdLength        = 0,
    };
    size_t env_len = env_cap;
    SignalingResult_t sig_rc = Signaling_ConstructWssMessage(&send_msg, env_buf, &env_len);
    free(b64_buf);
    if (SIGNALING_RESULT_OK != sig_rc) {
        printf("[signaling] ConstructWssMessage (ICE) failed: %d\n", (int) sig_rc);
        free(env_buf);
        return -1;
    }

    struct wslay_event_msg ws_msg = {
        .opcode     = WSLAY_TEXT_FRAME,
        .msg        = (const uint8_t *) env_buf,
        .msg_length = env_len,
    };
    int wrc = wslay_event_queue_msg(sig->ws_ctx, &ws_msg);
    free(env_buf);
    if (0 != wrc) {
        printf("[signaling] wslay_event_queue_msg (ICE) failed: %d\n", wrc);
        return -1;
    }

    printf("[signaling] send_ice_candidate: queued (%u bytes), signaling_tick will drain it\n", (unsigned) env_len);
    return 0;
}
